import random

card = {1:"黑桃1", 2:"黑桃2", 3:"黑桃3", 4:"黑桃4", 5:"黑桃5", 6:"黑桃6", 7:"黑桃7", 8:"黑桃8", 9:"黑桃9", 10:"黑桃10", 11:"黑桃J", 12:"黑桃Q", 13:"黑桃K",
        14:"梅花1", 15:"梅花2", 16:"梅花3", 17:"梅花4", 18:"梅花5", 19:"梅花6", 20:"梅花7", 21:"梅花8", 22:"梅花9", 23:"梅花10", 24:"梅花J", 25:"梅花Q", 26:"梅花K",
        27:"方塊1", 28:"方塊2", 29:"方塊3", 30:"方塊4", 31:"方塊5", 32:"方塊6", 33:"方塊7", 34:"方塊8", 35:"方塊9", 36:"方塊10", 37:"方塊J", 38:"方塊Q", 39:"方塊K",
        40:"愛心1", 41:"愛心2", 42:"愛心3", 43:"愛心4", 44:"愛心5", 45:"愛心6", 46:"愛心7", 47:"愛心8", 48:"愛心9", 49:"愛心10", 50:"愛心J", 51:"愛心Q", 52:"愛心K"}

ccard = [0, 0, 0, 0, 0]

num = 0

num = int(random.uniform(1, 52))

for i in range(5):

    if ccard.count(num) != 0:

        num = int(random.uniform(1, 52))

        if ccard.count(num) != 0:

            num = int(random.uniform(1, 52))

    ccard[i] = num
    print(ccard)

ccard.sort()

print(ccard)

for k in range(5):

    print(card[ccard[k]])